src/Documents/ИнвентаризацияТранзитов/ИнвентаризацияТранзитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИнвентаризацияТранзитов</name>
  <registerRecords>AccumulationRegister.КПолучению</registerRecords>
  <tabularSections>
    <name>Покупки</name>
    <attributes>
      <name>ДокументВыдачи</name>
      <type>
        <types>DocumentRef.ВыдачаТранзита</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>DefinedType.ТипыЗаказа</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеальноеКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/КПолучению/КПолучению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КПолучению</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Покупка</name>
    <type>
      <types>DefinedType.ТипыЗаказа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументВыдачи</name>
    <type>
      <types>DocumentRef.ВыдачаТранзита</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ИнвентаризацияТранзитов/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЗаполнитьОстатками(Команда)
	ЗаполнитьОстаткамиНаСервере();
КонецПроцедуры


Процедура ЗаполнитьОстаткамиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КПолучениюОстатки.Покупка,
		|	КПолучениюОстатки.Участник,
		|	КПолучениюОстатки.ДокументВыдачи,
		|	КПолучениюОстатки.КоличествоОстаток КАК количество
		|ИЗ
		|	РегистрНакопления.КПолучению.Остатки(, ) КАК КПолучениюОстатки
		|ГДЕ
		|	КПолучениюОстатки.ДокументВыдачи.Дата <= &НаДату";
    Запрос.Параметры.Вставить("НаДату",КонецДня(Объект.Дата));
	Результат = Запрос.Выполнить();
    Объект.Покупки.Загрузить(Результат.Выгрузить());

	
КонецПроцедуры
